RockstarPS/Einstein/programs/reference/einstein4.0/ti-am62x/sim-apps/sim/mcal-gen/SysconfigGeneratedDpl/VIP_Early_HMI/AM62Px.syscfg
gpio14.$name                   = "LED_GCLK";
gpio14.pinDir                  = "OUTPUT";
gpio14.useMcuDomainPeripherals = false;
gpio14.GPIO.$assign            = "GPIO0";
gpio14.GPIO.gpioPin.$assign    = "VOUT0_DATA12";

gpio15.$name                   = "LED_ERR";
gpio15.useMcuDomainPeripherals = false;
gpio15.GPIO.$assign            = "GPIO0";
gpio15.GPIO.gpioPin.$assign    = "VOUT0_DATA13";

gpio16.$name                    = "PIN_WKUP_UART0_CTSN";
gpio16.pinDir                   = "OUTPUT";
gpio16.MCU_GPIO.gpioPin.rx      = false;
gpio16.MCU_GPIO.gpioPin.pu_pd   = "pu";
gpio16.MCU_GPIO.gpioPin.$assign = "WKUP_UART0_CTSn";

gpio17.$name                   = "DI_SBATT2_ERR";
gpio17.useMcuDomainPeripherals = false;
gpio17.GPIO.$assign            = "GPIO0";
gpio17.GPIO.gpioPin.$assign    = "GPMC0_ADVn_ALE";

gpio18.$name                   = "DI_MD_TOUCH_INTN";
gpio18.useMcuDomainPeripherals = false;
gpio18.GPIO.$assign            = "GPIO0";
gpio18.GPIO.gpioPin.$assign    = "GPMC0_CSn1";

gpio19.$name                   = "DI_BL_FAULT";
gpio19.useMcuDomainPeripherals = false;
gpio19.GPIO.$assign            = "GPIO0";
gpio19.GPIO.gpioPin.$assign    = "VOUT0_DATA8";

gpio20.$name                   = "DI_SOC_FPDLINK3_LOCK";
gpio20.useMcuDomainPeripherals = false;
gpio20.GPIO.$assign            = "GPIO0";
gpio20.GPIO.gpioPin.$assign    = "MMC2_DAT2";

gpio21.$name                   = "DI_SOC_FPDLINK3_PASS";
gpio21.useMcuDomainPeripherals = false;
gpio21.GPIO.$assign            = "GPIO0";
gpio21.GPIO.gpioPin.$assign    = "MMC2_CLK";

gpio22.$name                   = "DI_ENET_MII_INT";
gpio22.useMcuDomainPeripherals = false;
gpio22.GPIO.$assign            = "GPIO0";
gpio22.GPIO.gpioPin.$assign    = "RGMII2_TD0";

gpio23.$name                   = "DI_IGN_MON";
gpio23.useMcuDomainPeripherals = false;
gpio23.GPIO.$assign            = "GPIO0";
gpio23.GPIO.gpioPin.$assign    = "RGMII2_TD1";

gpio24.$name                   = "DI_CABLE_DETECT";
gpio24.useMcuDomainPeripherals = false;
gpio24.GPIO.$assign            = "GPIO1";
gpio24.GPIO.gpioPin.$assign    = "RGMII2_RX_CTL";

gpio25.$name                   = "DI_TCON_IND_OUT";
gpio25.useMcuDomainPeripherals = false;
gpio25.GPIO.$assign            = "GPIO1";
gpio25.GPIO.gpioPin.$assign    = "MCASP0_ACLKX";

gpio26.$name                   = "DI_MCU_FALD_CONN_CHK";
gpio26.useMcuDomainPeripherals = false;
gpio26.GPIO.$assign            = "GPIO1";
gpio26.GPIO.gpioPin.$assign    = "RGMII2_RD0";

gpio27.$name                   = "DI_LDO_1V2_FAULTN";
gpio27.useMcuDomainPeripherals = false;
gpio27.GPIO.$assign            = "GPIO1";
gpio27.GPIO.gpioPin.$assign    = "RGMII2_RD1";

gpio28.$name                   = "DI_TFT_ER_DET";
gpio28.useMcuDomainPeripherals = false;
gpio28.GPIO.$assign            = "GPIO1";
gpio28.GPIO.gpioPin.$assign    = "MMC1_SDCD";

gpio29.$name                    = "DO_MCU_RESETSTAZ";
gpio29.pinDir                   = "OUTPUT";
gpio29.MCU_GPIO.$assign         = "MCU_GPIO0";
gpio29.MCU_GPIO.gpioPin.$assign = "MCU_RESETSTATz";

gpio30.$name                   = "DO_VPP_EN";
gpio30.pinDir                  = "OUTPUT";
gpio30.useMcuDomainPeripherals = false;
gpio30.GPIO.$assign            = "GPIO0";
gpio30.GPIO.gpioPin.rx         = false;
gpio30.GPIO.gpioPin.$assign    = "VOUT0_DATA2";

gpio31.$name                   = "DO_MD_GNSS_BOOT_EN";
gpio31.pinDir                  = "OUTPUT";
gpio31.useMcuDomainPeripherals = false;
gpio31.GPIO.$assign            = "GPIO0";
gpio31.GPIO.gpioPin.rx         = false;
gpio31.GPIO.gpioPin.$assign    = "VOUT0_DATA3";

gpio32.$name                   = "DO_MD_GNSS_RESETP";
gpio32.pinDir                  = "OUTPUT";
gpio32.useMcuDomainPeripherals = false;
gpio32.GPIO.$assign            = "GPIO0";
gpio32.GPIO.gpioPin.rx         = false;
gpio32.GPIO.gpioPin.$assign    = "VOUT0_DATA5";

gpio33.$name                   = "DO_MD_GNSS_PWR_EN";
gpio33.pinDir                  = "OUTPUT";
gpio33.useMcuDomainPeripherals = false;
gpio33.GPIO.$assign            = "GPIO0";
gpio33.GPIO.gpioPin.rx         = false;
gpio33.GPIO.gpioPin.$assign    = "VOUT0_DATA6";

gpio34.$name                   = "DO_BLU_OPAMP_PWR_EN";
gpio34.pinDir                  = "OUTPUT";
gpio34.useMcuDomainPeripherals = false;
gpio34.GPIO.$assign            = "GPIO0";
gpio34.GPIO.gpioPin.rx         = false;
gpio34.GPIO.gpioPin.$assign    = "VOUT0_DATA9";

gpio35.$name                   = "DO_BLU_DWALED_EN";
gpio35.pinDir                  = "OUTPUT";
gpio35.useMcuDomainPeripherals = false;
gpio35.GPIO.gpioPin.rx         = false;
gpio35.GPIO.gpioPin.$assign    = "VOUT0_DATA15";

gpio36.$name                   = "DO_TCON_BYPASS_MODE";
gpio36.pinDir                  = "OUTPUT";
gpio36.useMcuDomainPeripherals = false;
gpio36.GPIO.$assign            = "GPIO0";
gpio36.GPIO.gpioPin.rx         = false;
gpio36.GPIO.gpioPin.$assign    = "VOUT0_HSYNC";

gpio37.$name                   = "DO_TCON_BYPASS_SEL0";
gpio37.pinDir                  = "OUTPUT";
gpio37.useMcuDomainPeripherals = false;
gpio37.GPIO.$assign            = "GPIO0";
gpio37.GPIO.gpioPin.rx         = false;
gpio37.GPIO.gpioPin.$assign    = "VOUT0_DE";

gpio38.$name                   = "DO_TCON_BYPASS_SEL1";
gpio38.pinDir                  = "OUTPUT";
gpio38.useMcuDomainPeripherals = false;
gpio38.GPIO.$assign            = "GPIO0";
gpio38.GPIO.gpioPin.rx         = false;
gpio38.GPIO.gpioPin.$assign    = "VOUT0_VSYNC";

gpio39.$name                   = "DO_SOC_FPDLINK3_PDB";
gpio39.pinDir                  = "OUTPUT";
gpio39.useMcuDomainPeripherals = false;
gpio39.GPIO.$assign            = "GPIO0";
gpio39.GPIO.gpioPin.rx         = false;
gpio39.GPIO.gpioPin.$assign    = "MMC2_DAT1";

gpio40.$name                   = "DO_SOC_FPDLINK3_INTB";
gpio40.pinDir                  = "OUTPUT";
gpio40.useMcuDomainPeripherals = false;
gpio40.GPIO.$assign            = "GPIO0";
gpio40.GPIO.gpioPin.rx         = false;
gpio40.GPIO.gpioPin.$assign    = "MMC2_DAT0";

gpio41.$name                   = "DO_SOC_FPDLINK3_BISTEN";
gpio41.pinDir                  = "OUTPUT";
gpio41.useMcuDomainPeripherals = false;
gpio41.GPIO.$assign            = "GPIO0";
gpio41.GPIO.gpioPin.rx         = false;
gpio41.GPIO.gpioPin.$assign    = "MMC2_CMD";

gpio42.pinDir                  = "OUTPUT";
gpio42.useMcuDomainPeripherals = false;
gpio42.$name                   = "DO_EN_BUCK_FALD";
gpio42.GPIO.$assign            = "GPIO1";
gpio42.GPIO.gpioPin.rx         = false;

gpio43.$name                   = "DO_MCU_AMUX_S1";
gpio43.useMcuDomainPeripherals = false;
gpio43.pinDir                  = "OUTPUT";
gpio43.GPIO.$assign            = "GPIO1";
gpio43.GPIO.gpioPin.rx         = false;
gpio43.GPIO.gpioPin.$assign    = "MCASP0_AFSX";

