RockstarPS/Einstein/programs/reference/einstein4.0/ti-am62x/sim-apps/sim/mcal-gen/SysconfigGeneratedDpl/VIP_Early_HMI/AM62Px.syscfg
gpio44.$name                   = "DO_MCU_AMUX_S0";
gpio44.pinDir                  = "OUTPUT";
gpio44.useMcuDomainPeripherals = false;
gpio44.GPIO.$assign            = "GPIO1";
gpio44.GPIO.gpioPin.rx         = false;
gpio44.GPIO.gpioPin.$assign    = "MCASP0_AFSR";

gpio45.$name                   = "DESER_SPI1_DO";
gpio45.pinDir                  = "OUTPUT";
gpio45.useMcuDomainPeripherals = false;
gpio45.GPIO.$assign            = "GPIO1";
gpio45.GPIO.gpioPin.rx         = false;
gpio45.GPIO.gpioPin.$assign    = "MMC1_DAT3";

gpio46.$name                   = "DO_SOC_TCON_GRBN";
gpio46.pinDir                  = "OUTPUT";
gpio46.useMcuDomainPeripherals = false;
gpio46.GPIO.$assign            = "GPIO1";
gpio46.GPIO.gpioPin.rx         = false;
gpio46.GPIO.gpioPin.$assign    = "MMC1_DAT1";

gpio47.$name                   = "DO_TFT_CSB";
gpio47.pinDir                  = "OUTPUT";
gpio47.useMcuDomainPeripherals = false;
gpio47.GPIO.$assign            = "GPIO1";
gpio47.GPIO.gpioPin.rx         = false;
gpio47.GPIO.gpioPin.$assign    = "MMC1_SDWP";

gpio48.$name                    = "DO_TFT_BL_EN";
gpio48.pinDir                   = "OUTPUT";
gpio48.MCU_GPIO.$assign         = "MCU_GPIO0";
gpio48.MCU_GPIO.gpioPin.rx      = false;
gpio48.MCU_GPIO.gpioPin.$assign = "WKUP_CLKOUT0";

gpio49.$name = "CONFIG_GPIO1";

gpio50.$name                    = "CONFIG_GPIO2";
gpio50.MCU_GPIO.gpioPin.rx      = false;
gpio50.MCU_GPIO.gpioPin.$assign = "WKUP_I2C0_SCL";

gpio51.$name                    = "CONFIG_GPIO3";
gpio51.MCU_GPIO.gpioPin.$assign = "MCU_MCAN1_TX";

i2c1.$name               = "CONFIG_I2C0";
i2c1.MCU_I2C.$assign     = "MCU_I2C0";
i2c1.MCU_I2C.SCL.$assign = "MCU_I2C0_SCL";
i2c1.MCU_I2C.SDA.$assign = "MCU_I2C0_SDA";
i2c1.I2C_child.$name     = "drivers_i2c_v0_i2c_v0_template0";

i2c2.$name                   = "CONFIG_I2C1";
i2c2.useMcuDomainPeripherals = false;
i2c2.I2C_child.$name         = "drivers_i2c_v0_i2c_v0_template1";
i2c2.I2C.$assign             = "I2C3";
i2c2.I2C.SCL.$assign         = "UART0_CTSn";
i2c2.I2C.SDA.$assign         = "UART0_RTSn";

i2c3.$name                   = "CONFIG_I2C3";
i2c3.useMcuDomainPeripherals = false;
i2c3.I2C_child.$name         = "drivers_i2c_v0_i2c_v0_template2";
i2c3.I2C.$assign             = "I2C1";

mcspi1.$name                           = "CONFIG_MCSPI0";
mcspi1.mcspiChannel[0].$name           = "CONFIG_MCSPI_CH0";
mcspi1.mcspiChannel[0].MCU_CSn.$assign = "MCU_SPI0_CS1";

mcspi2.$name                   = "CONFIG_MCSPI1";
mcspi2.useMcuDomainPeripherals = false;
mcspi2.pinMode                 = 3;
mcspi2.mcspiChannel[0].$name   = "CONFIG_MCSPI_CH1";
mcspi2.SPI.$assign             = "SPI2";

mcspi3.$name                       = "CONFIG_MCSPI2";
mcspi3.useMcuDomainPeripherals     = false;
mcspi3.mcspiChannel[0].$name       = "CONFIG_MCSPI_CH2";
mcspi3.mcspiChannel[0].CSn.$assign = "SPI0_CS1";
mcspi3.SPI.$assign                 = "SPI0";
mcspi3.SPI.CLK.$assign             = "SPI0_CLK";
mcspi3.SPI.D0.$assign              = "SPI0_D0";
mcspi3.SPI.D1.$assign              = "SPI0_D1";

uart1.$name                = "CONFIG_UART0";
uart1.MCU_UART.$assign     = "MCU_USART0";
uart1.MCU_UART.RXD.$assign = "MCU_UART0_RXD";
uart1.MCU_UART.TXD.$assign = "MCU_UART0_TXD";

uart2.$name                      = "CONFIG_UART1";
uart2.useMcuDomainPeripherals    = false;
uart2.useWakeupDomainPeripherals = true;
uart2.WKUP_UART.$assign          = "WKUP_USART0";
uart2.WKUP_UART.RXD.$assign      = "WKUP_UART0_RXD";
uart2.WKUP_UART.TXD.$assign      = "WKUP_UART0_TXD";

debug_log.enableLogZoneError   = false;
debug_log.enableLogZoneWarning = false;
debug_log.enableCssLog         = false;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
gpio2.GPIO.$suggestSolution              = "GPIO1";
gpio3.GPIO.$suggestSolution              = "GPIO1";
gpio5.GPIO.$suggestSolution              = "GPIO0";
gpio6.GPIO.$suggestSolution              = "GPIO1";
gpio8.GPIO.$suggestSolution              = "GPIO1";
gpio9.MCU_GPIO.$suggestSolution          = "MCU_GPIO0";
gpio10.MCU_GPIO.$suggestSolution         = "MCU_GPIO0";
gpio11.GPIO.$suggestSolution             = "GPIO0";
gpio16.MCU_GPIO.$suggestSolution         = "MCU_GPIO0";
gpio35.GPIO.$suggestSolution             = "GPIO0";
gpio42.GPIO.gpioPin.$suggestSolution     = "RGMII2_TD3";
gpio49.MCU_GPIO.$suggestSolution         = "MCU_GPIO0";
gpio49.MCU_GPIO.gpioPin.$suggestSolution = "MCU_SPI0_CS0";
gpio50.MCU_GPIO.$suggestSolution         = "MCU_GPIO0";
gpio51.MCU_GPIO.$suggestSolution         = "MCU_GPIO0";
i2c3.I2C.SCL.$suggestSolution            = "I2C1_SCL";
i2c3.I2C.SDA.$suggestSolution            = "I2C1_SDA";
mcspi1.MCU_SPI.$suggestSolution          = "MCU_SPI0";
mcspi1.MCU_SPI.CLK.$suggestSolution      = "MCU_SPI0_CLK";
mcspi1.MCU_SPI.D0.$suggestSolution       = "MCU_SPI0_D0";
mcspi1.MCU_SPI.D1.$suggestSolution       = "MCU_SPI0_D1";
mcspi2.SPI.CLK.$suggestSolution          = "MCASP0_ACLKR";
mcspi2.SPI.D0.$suggestSolution           = "MCASP0_AXR3";
mcspi2.SPI.D1.$suggestSolution           = "MCASP0_AXR2";
